// 1.填空题
// 事件的三个要素分别是___事件源，事件类型，事件驱动程序____
// DOM中的___innerHTML___用于设置或获取元素开始标签和结束标签之间的HTML内容
// 通过元素对象的__setAttribute()___方法可以设置元素的自定义属性
// 将一个节点添加到父节点的所有子节点末尾用__insertBefore()___方法
// __resize__事件是在窗口改变时触发的

// 2.简答题
// 简述使用innerHTML属性和innerText属性操作元素内容有什么不同
//    DOM中的innerHTML属性用于设置或获取元素开始标签和结束标签之间的HTML内容，返回结果包含HTML标签，并保留空格和换行，而innerText属性获取的元素内容不包含HTML标签

// 简述如何获取鼠标指针在元素中的位置
//    通过事件属性的方式注册事件，一个事件类型只能注册一个事件处理函数。而在javascript中还有一中为元素注册事件的方式，就是事件监听，通过事件监听可以给一个事件类型注册多个事件处理函数

// 简述DOM和BOM的区别
//    DOM将整个文档视为树形结构，这个结构被称为文档树。BOM是浏览器提供的用于JavaScript与浏览器窗口进行交互的一系列对象。在DOM中，顶级对象是window,表示浏览器窗口，其他对象都是window对象的属性。

